; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	infrared0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation0 - direction
	Star7 - direction
	Star6 - direction
	GroundStation5 - direction
	Star3 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star7)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star3)
	(supports instrument8 spectrograph2)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(pointing satellite2 Star6)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (turn_to satellite2 star6 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star6)
   goals met: 1 of 7
2. (turn_to satellite1 star4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star4)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 7
5. (turn_to satellite1 planet10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet10)
   goals met: 1 of 7
6. (take_image satellite1 planet10 instrument2 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 7
7. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 3 of 7
9. (turn_to satellite1 planet9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet9)
   goals met: 3 of 7
10. (take_image satellite1 planet9 instrument2 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 4 of 7
11. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 4 of 7
12. (take_image satellite1 star12 instrument2 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 5 of 7
13. (turn_to satellite1 phenomenon11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 7
14. (take_image satellite1 phenomenon11 instrument2 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 7 of 7
